Autodesk.Revit.DB.Structure.AnalyticalToPhysicalAssociationManager.GetPhysicalCounterPart(Autodesk.Revit.DB.ElementId)
Returns id of the physical element which is in association with the element with the given ElementId.
elementId:
Element id of analytical element for which we want to get the associated element.
Returns:
Id of the associated element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2023

Autodesk.Revit.DB.Structure.AnalyticalToPhysicalAssociationManager.GetAnalyticalCounterPart(Autodesk.Revit.DB.ElementId)
Returns id of the analytical element which is in association with the element with the given ElementId.
elementId:
Element id of physical element for which we want to get the associated element.
Returns:
Id of the associated element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2023

Autodesk.Revit.DB.Structure.AnalyticalToPhysicalAssociationManager.IsPhysicalElement(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Returns true if the element is a physical element.
doc:
Revit document.
id:
The element to be checked.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2023.1

Autodesk.Revit.DB.Structure.AnalyticalToPhysicalAssociationManager.IsAnalyticalElement(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Returns true if the element is an analytical element.
doc:
Revit document.
id:
The element to be checked.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2023.1

Autodesk.Revit.DB.Structure.AnalyticalToPhysicalAssociationManager.EnableAssistedAssociation
Indicates if associations between Analytical and Physical Elements should be created automatically.
Remarks:
If this flag is set to true, the associations are made on creation of an analytical element over a physical element.
If it's set to false, then the associations between analytical and physical elements have to be made manually.
Since:
2023.1